Courses/7140/Lectures/SecureProg/ModelChecking/index.org
# -*- mode: org -*-
#+DATE: 2018-06-08
#+TITLE:  Model Checking
#+AUTHOR: Prabhaker Mateti
#+HTML_LINK_HOME: ../../../Top/index.html
#+HTML_LINK_UP: ../
#+HTML_HEAD: <style> P,li {text-align: justify} code {color: brown;} @media screen {BODY {margin: 10%} }</style>
#+BIND: org-html-preamble-format (("en" "<a href=\"../../\"> ../../</a>"))
#+BIND: org-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2017 <a href=\"http://www.wright.edu/~pmateti\">www.wright.edu/~pmateti</a> &bull; %d"))
#+STARTUP:showeverything
#+OPTIONS: toc:2

* What is Model Checking?

1. Model checking is a method for formally verifying finite-state
   concurrent systems. Specifications about the system are expressed
   as (temporal) logic formulas, and efficient symbolic algorithms are
   used to traverse the model defined by the system and check if the
   specification holds or not.

1. Mordechai (Moti) Ben-Ari, A Primer on Model Checking, [[http://spinroot.com/spin/Doc/p40-ben-ari.pdf][PDF]] 8pp, ACM
   InRoads, 2010. Recommended Reading.

* How Does Model Checking relate to Axiomatics?

1. TBD

* Model Checking Tools

** SPIN

1. Gerard J. Holzmann. [[https://www.amazon.com/SPIN-Model-Checker-Reference-paperback/dp/0321773713][The Spin Model Checker: Primer and Reference
   Manual]], AddisonWesley, Boston MA, 2004.  [[http://spinroot.com/courses/summer/Papers/spin_1997.pdf][Original Paper 1997]]
1. iSPIN The easiest way to get started with Spin is to use the
      graphical interface =ispin=.
2. http://spinroot.com/spin/Man/README.html includes Installing
      Spin.  FOSS.

** NuSMV

1. [[http://nusmv.fbk.eu/][NuSMV]] FOSS.  Alessandro Cimatti, Edmund M. Clarke, Enrico Giunchiglia,
   Fausto Giunchiglia, Marco Pistore, Marco Roveri, Roberto
   Sebastiani, and Armando Tacchella. NuSMV 2: An opensource tool for
   symbolic model checking. In CAV ‘02: Proceedings of the 14th
   International Conference on Computer Aided Verifi cation, pages
   359–364, London, UK, 2002. Springer-Verlag.
1. http://nusmv.fbk.eu/NuSMV/download/getting-v2.html
2. http://nusmv.fbk.eu/#Other_projects
3. 2018 NuSMV 2.6.0 is released

* References

1. https://en.wikipedia.org/wiki/Model_checking   Recommended Reading.

1. Mordechai (Moti) Ben-Ari, A Primer on Model Checking, [[http://spinroot.com/spin/Doc/p40-ben-ari.pdf][PDF]] 8pp, ACM
   InRoads, 2010. Recommended Reading.

1. http://cecs.wright.edu/~pmateti/Courses/FormalMethods/Lectures/ModelChecking/Model-Checking-BJ.pptx
   Slides by Bharat Jayaraman, Professor, SUNY Buffalo, 2017. Required
   Reading.



* End
# Local variables:
# after-save-hook: org-html-export-to-html
# end:
