Courses/7140/Lectures/SecureProg/ModelChecking/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Model Checking</title>
<!-- 2018-07-16 Mon 21:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Model Checking</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. What is Model Checking?</a></li>
<li><a href="#sec-2">2. How Does Model Checking relate to Axiomatics?</a></li>
<li><a href="#sec-3">3. Model Checking Tools</a>
<ul>
<li><a href="#sec-3-1">3.1. SPIN</a></li>
<li><a href="#sec-3-2">3.2. NuSMV</a></li>
</ul>
</li>
<li><a href="#sec-4">4. References</a></li>
<li><a href="#sec-5">5. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What is Model Checking?</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Model checking is a method for formally verifying finite-state
concurrent systems. Specifications about the system are expressed
as (temporal) logic formulas, and efficient symbolic algorithms are
used to traverse the model defined by the system and check if the
specification holds or not.
</li>

<li>Mordechai (Moti) Ben-Ari, A Primer on Model Checking, <a href="http://spinroot.com/spin/Doc/p40-ben-ari.pdf">PDF</a> 8pp, ACM
InRoads, 2010. Recommended Reading.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> How Does Model Checking relate to Axiomatics?</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>TBD
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Model Checking Tools</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> SPIN</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Gerard J. Holzmann. <a href="https://www.amazon.com/SPIN-Model-Checker-Reference-paperback/dp/0321773713">The Spin Model Checker: Primer and Reference
Manual</a>, AddisonWesley, Boston MA, 2004.  <a href="http://spinroot.com/courses/summer/Papers/spin_1997.pdf">Original Paper 1997</a>
</li>
<li>iSPIN The easiest way to get started with Spin is to use the
graphical interface <code>ispin</code>.
</li>
<li><a href="http://spinroot.com/spin/Man/README.html">http://spinroot.com/spin/Man/README.html</a> includes Installing
Spin.  FOSS.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> NuSMV</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li><a href="http://nusmv.fbk.eu/">NuSMV</a> FOSS.  Alessandro Cimatti, Edmund M. Clarke, Enrico Giunchiglia,
Fausto Giunchiglia, Marco Pistore, Marco Roveri, Roberto
Sebastiani, and Armando Tacchella. NuSMV 2: An opensource tool for
symbolic model checking. In CAV ‘02: Proceedings of the 14th
International Conference on Computer Aided Verifi cation, pages
359–364, London, UK, 2002. Springer-Verlag.
</li>
<li><a href="http://nusmv.fbk.eu/NuSMV/download/getting-v2.html">http://nusmv.fbk.eu/NuSMV/download/getting-v2.html</a>
</li>
<li><a href="http://nusmv.fbk.eu/#Other_projects">http://nusmv.fbk.eu/#Other_projects</a>
</li>
<li>2018 NuSMV 2.6.0 is released
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> References</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="https://en.wikipedia.org/wiki/Model_checking">https://en.wikipedia.org/wiki/Model_checking</a>   Recommended Reading.
</li>

<li>Mordechai (Moti) Ben-Ari, A Primer on Model Checking, <a href="http://spinroot.com/spin/Doc/p40-ben-ari.pdf">PDF</a> 8pp, ACM
InRoads, 2010. Recommended Reading.
</li>

<li><a href="http://cecs.wright.edu/~pmateti/Courses/FormalMethods/Lectures/ModelChecking/Model-Checking-BJ.pptx">http://cecs.wright.edu/~pmateti/Courses/FormalMethods/Lectures/ModelChecking/Model-Checking-BJ.pptx</a>
Slides by Bharat Jayaraman, Professor, SUNY Buffalo, 2017. Required
Reading.
</li>
</ol>
</div>
</div>



<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> End</h2>
<div class="outline-text-2" id="text-5">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2017 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2018-06-08
</div>
</body>
</html>
